Autodesk.Revit.DB.AnnotationSymbolTypeSet
A set that contains AnnotationSymbol types.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.Insert(Autodesk.Revit.DB.AnnotationSymbolType)
System.Int32
Insert the specified AnnotationSymbol type into the set.
item: The AnnotationSymbol type to be inserted into the set.
Returns: Returns whether the AnnotationSymbol type was inserted into the set.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.ReverseIterator
Autodesk.Revit.DB.AnnotationSymbolTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.ForwardIterator
Autodesk.Revit.DB.AnnotationSymbolTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.Erase(Autodesk.Revit.DB.AnnotationSymbolType)
System.Int32
Removes a specified AnnotationSymbol type from the set.
item: The AnnotationSymbol type to be erased.
Returns: The number of AnnotationSymbol types that were erased from the set.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.Contains(Autodesk.Revit.DB.AnnotationSymbolType)
System.Boolean
Tests for the existence of a AnnotationSymbol type within the set.
item: The AnnotationSymbol type to be searched for.
Returns: The Contains method returns True if the AnnotationSymbol type is within the set, otherwise False.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.Clear
void
Removes every AnnotationSymbol type from the set, rendering it empty.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.Size
System.Int32
get
Returns the number of AnnotationSymbol types that are in the set.

Autodesk.Revit.DB.AnnotationSymbolTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.